import inspect
import random
from datetime import datetime, UTC


def get_utc_now():
    return int(datetime.now(tz=UTC).timestamp())


def is_sync_function(func):
    return inspect.isfunction(func) and not inspect.iscoroutinefunction(func)


def namedtuple2dict(instance):
    return {field: getattr(instance, field) for field in instance._fields}


ukrainian_names = [
    # Чоловічі імена
    "Андрій", "Богдан", "Василь", "Віктор", "Віталій", "Володимир", "Геннадій",
    "Григорій", "Дмитро", "Євген", "Іван", "Ігор", "Кирило", "Леонід",
    "Максим", "Микита", "Микола", "Олег", "Олександр", "Олексій", "Павло",
    "Петро", "Роман", "Сергій", "Степан", "Тарас", "Тимофій", "Федір",
    "Юрій", "Ярослав", "Антон", "Арсен", "Арсеній", "Артур", "Богуслав",
    "Борис", "Валентин", "Валерій", "Владислав", "Георгій", "Денис",
    "Єлисей", "Захар", "Ілля", "Костянтин", "Любомир", "Марко", "Михайло",
    "Назар", "Ростислав", "Станіслав", "Филип", "Яків", "Данило", "Давид",
    "Артем", "Анатолій", "Андронік", "Богдан", "Веніамін", "Гліб", "Едуард",
    "Ернест", "Євгеній", "Зіновій", "Лаврентій", "Лев", "Мирослав",
    "Нестор", "Остап", "Платон", "Руслан", "Тимур", "Юліан",

    # Жіночі імена
    "Аліна", "Аліса", "Анастасія", "Анна", "Антоніна", "Валентина", "Валерія",
    "Віра", "Вікторія", "Галина", "Дарина", "Діана", "Євгенія", "Єлизавета",
    "Інна", "Ірина", "Катерина", "Ксенія", "Лариса", "Людмила", "Марина",
    "Марія", "Мирослава", "Надія", "Наталія", "Ніна", "Оксана", "Олена",
    "Олеся", "Ольга", "Роксолана", "Світлана", "Сніжана", "Софія", "Тамара",
    "Тетяна", "Уляна", "Юлія", "Яна", "Ярослава", "Агата", "Алла", "Ангеліна",
    "Аніта", "Богдана", "Василина", "Ганна", "Дарія", "Емілія", "Євдокія",
    "Злата", "Карина", "Лідія", "Любов", "Марта", "Ніка", "Поліна", "Римма",
    "Стефанія", "Устина", "Христина", "Елеонора", "Любава", "Меланія"
]

ukrainian_surnames = [
    "Шевченко", "Федоренко", "Бондаренко", "Коваленко", "Мельник", "Лисенко",
    "Кравченко", "Романенко", "Гончаренко", "Бойко", "Ткаченко", "Козак",
    "Василенко", "Іваненко", "Петренко", "Савченко", "Поліщук", "Сидоренко",
    "Демченко", "Мартиненко", "Мороз", "Павленко", "Клименко", "Макаренко",
    "Юрченко", "Захарченко", "Семененко", "Тимошенко", "Лазаренко",
    "Гриценко", "Олійник", "Рибак", "Кравчук", "Герман", "Гайдук", "Дзюба",
    "Зубко", "Ковалюк", "Ковальчук", "Коломієць", "Король", "Котляр", "Кузьменко",
    "Левченко", "Микитенко", "Михайленко", "Мовчан", "Назаренко",
    "Овчаренко", "Опанасенко", "Остапенко", "Павлюк", "Палій", "Панчук",
    "Писаренко", "Пономаренко", "Попович", "Руденко", "Савчук", "Самойленко",
    "Стеценко", "Тарасенко", "Тимченко", "Федорчук", "Царук", "Черненко",
    "Шаповал", "Швець", "Щербак", "Яковенко", "Яремчук", "Гуменюк", "Дорошенко",
    "Євдокимов", "Журавель", "Іващенко", "Калиниченко", "Канівець", "Карпенко",
    "Кириченко", "Ковалів", "Ковтун", "Козаченко", "Козяр",
    "Корнійчук", "Кравців", "Крамаренко", "Лавренюк",
    "Литвин", "Луценко", "Мазур", "Мандзюк", "Маслюк", "Морозенко", "Ніколенко",
    "Овсієнко", "Омельченко", "Пархоменко", "Петрук", "Пилипенко",
    "Пономарьов", "Приходько", "Романюк", "Сагайдак", "Сергієнко", "Слободян",
    "Соловйов", "Стародуб", "Степаненко", "Таращук",
    "Таращенко", "Терещенко", "Титаренко", "Тихоненко", "Тищенко",
    "Третяк", "Турчин", "Харченко", "Хоменко", "Цимбал", "Чебан",
    "Шаповаленко", "Шевчук", "Шеремета", "Ющенко", "Юхименко", "Янчук"
]


def random_first_name():
    return random.choice(ukrainian_names)


def random_last_name():
    return random.choice(ukrainian_surnames)


async def with_callback(main_func, callback_func):
    result = await main_func
    await callback_func(result)
